[
  {
    "file": "experiments/perlin-noise-rain-experiment.js",
    "name": "Rainy Perlin Noise",
    "description": "For this work, during the rainy days in Jönköping I got inspired by the raindrops getting bigger and smaller through following a trail on my window. I coded it as an experiment based on the Perlin Noise example from Garrit on Canvas."
  },
  {
    "file": "experiments/gradient-experiment-perlin-noise.js",
    "name": "Purple 'heatmap' Perlin Noise",
    "description": "This variation was inspired by complementary graphics of the 'Sour' album by Olivia Rodrigo. I coded it as an experiment based on the Perlin Noise example from Garrit on Canvas."
  },
  {
    "file": "experiments/sunflower-experiment.js",
    "name": "Van Gogh Sunflowers",
    "description": "For these flowers, I got inspired by the painting Sunflowers by Van Gogh but I focused solely on the flowers. I coded it as an experiment based on the flower example that we live coded with Bassima during a lecture."
  },
  {
    "file": "experiments/moving-flowers-try.js",
    "name": "Van Gogh Sunflowers Movement",
    "description": "For these flowers, I got inspired by the painting Sunflowers by Van Gogh, but also focused on distorted forms which were a main characteristic of the Post-Impressionist movement that the artist was a part of. I coded it as an experiment based on the flower example that we live coded with Bassima during a lecture and used help from the p5 referencing for the movement."
  },
  {
    "file": "experiments/sunflower-further-experiment.js",
    "name": "Van Gogh Sunflowers Reimagined through Generative Art",
    "description": "For this work, I got inspired by the painting Sunflowers by Van Gogh and built upon the initial flower experiment, adding stems, a vase, and more details such as additional petals, table, etc. I coded it as an experiment based on the flower example that we live coded with Bassima during a lecture."
  },
  {
    "file": "experiments/flow-field-experiment.js",
    "name": "Flow Field 'Matrix'",
    "description": "For this work, tried creating a flow field with randomly coloured rectangled. I based the code on the flow field example, experimenting with the numbers until I reached a result which satisfied my vision."
  },
  {
    "file": "experiments/flow-field-matrix.js",
    "name": "Flow Field number Matrix",
    "description": "For this work, I built upon the 'Matrix' experiment, creating an actual number matrix. '"
  },
  {
    "file": "experiments/flow-field-variation-2.js",
    "name": "Flow Field Human Veins (tree)",
    "description": "For this work, I built upon the"
  },
  {
    "file": "experiments/flow-field-variation-3.js",
    "name": "DIY flow field",
    "description": "For this work, I built upon the Veins(tree) variation. Enter your mouse on the field and see the magic."
  }
]
